[
  {
    "id": 8,
    "title": "ChromoLCD: LCD-based Compact Reprogrammer for On-the-fly High-Resolution Images on Photochromic Surfaces.",
    "authors": "<b>Yunyi Zhu</b>, Qingyuan Li, Katherine Arianna Yan, Emily Guan, Alexandru Luchianov, Eden Hen, Stefanie Mueller.",
    "conference": "Proceedings of TEI 2026. (to appear)",
    "thumbnail":"chromolcd.gif",
    "description": "ChromoLCD is a compact and high-resolution surface reprogrammer for photochromic color-changing surfaces. ChromoLCD combines a liquid crystal display (LCD) with custom backlights, and enables on-the-fly reprogramming of everyday surfaces."
  },
  {
    "id": 7,
    "title": "FiberCircuits: A Miniaturization Framework To Manufacture Fibers That Embed Integrated Circuits.",
    "authors": "Cedric Honnet, Wedyan Babatain, Yiyue Luo, Ozgun Kilic Afsar, Chloe Bensahel, Sarah Nicita, <b>Yunyi Zhu</b>, Andreea Danielescu, Neil Gershenfeld, Joseph Paradiso",
    "conference": "Proceedings of ACM UIST 2025.",
    "thumbnail":"fibercircuits.gif",
    "doi": "https://dl.acm.org/doi/10.1145/3746059.3747802",
    "pdf": "https://honnet.github.io/publications/UIST25-FiberCircuits.pdf",
    "video": "https://drive.google.com/file/d/1kdXWs3BDAerae0YqgsB41mT_l99dUZgY/view",
    "projectPage": "https://www.media.mit.edu/projects/fibercircuits/overview/",
    "description": "FiberCircuits is a set of design and fabrication guidelines for the manufacturing of high-density circuits that are thin enough for full encapsulation within fibers, achieving a 1.4 mm-wide ARM microcontroller with sensors as small as 0.9 mm-wide and arrays of 1 mm-wide addressable LEDs woven into interactive textiles."
  },
  {
    "id": 6,
    "title": "Generating Tactile Textures with Generative AI for Digital Fabrication.",
    "authors": "Faraz Faruqi, Maxine Perroni-Scharf, Jaskaran Singh Walia, <b>Yunyi Zhu</b>, Shuyue Feng, Donald Degraen, and Stefanie Mueller.",
    "conference": "Proceedings of ACM CHI 2025.",
    "thumbnail": "tactstyle.png",
    "doi":"https://dl.acm.org/doi/10.1145/3706598.3713740",
    "pdf":"https://groups.csail.mit.edu/hcie/files/research-projects/tactstyle/tactstyle.pdf",
    "video":"https://www.youtube.com/watch?v=vIMCwYZR7wY&ab_channel=MITCSAIL",
    "projectPage":"https://hcie.csail.mit.edu/research/tactstyle/tactstyle.html",
    "description": "TactStyle is a system that allows creators to stylize 3D models with images while incorporating the expected tactile properties. TactStyle accomplishes this using a modified image-generation model fine-tuned to generate heightfields for given surface textures."
  },
  {
    "id": 5,
    "title": "PortaChrome: A Portable Contact Light Source for Integrated Re-Programmable Multi-Color Textures",
    "authors": "<b>Yunyi Zhu</b>, Cedric Honnet, Yixiao Kang, Junyi Zhu, Angelina J. Zheng, Kyle Heinz, Grace Tang, Luca Musk, Michael Wessely, Stefanie Mueller.",
    "conference": "Proceedings of ACM UIST 2024.",
    "thumbnail": "portachrome.gif",
    "doi": "https://dl.acm.org/doi/10.1145/3654777.3676458",
    "pdf": "https://groups.csail.mit.edu/hcie/files/research-projects/portachrome/2024-uist-portachrome-paper.pdf",
    "video": "https://www.youtube.com/watch?v=w39gTtAkNKQ&feature=youtu.be",
    "projectPage": "https://hcie.csail.mit.edu/research/portachrome/portachrome.html",
    "description": "PortaChrome is a portable and flexible light source compatible with photochromic material. When PortaChrome makes contact with objects previously coated with photochromic dye, the UV and RGB LEDs inside PortaChrome create multicolor textures on the objects. PortaChrome can be attached onto everyday objects to integrate the color-changing process into everyday user interation."
  },
  {
    "id": 4,
    "title": "InfraredTags: Embedding Invisible AR Markers and Barcodes Using Low-Cost, Infrared-Based 3D Printing and Imaging Tools.",
    "authors": "Mustafa Doga Dogan, Ahmad Taka, Michael Lu, <b>Yunyi Zhu</b>, Akshat Kumar, Aakar Gupta, Stefanie Mueller.",
    "conference": "Proceedings of ACM CHI 2022.",
    "thumbnail": "infraredtags-thumbnail.png",
    "doi": "https://dl.acm.org/doi/10.1145/3491102.3501951",
    "pdf": "https://groups.csail.mit.edu/hcie/files/research-projects/infraredtags/2022-CHI-InfraredTags-paper.pdf",
    "video": "https://www.youtube.com/watch?v=Tjs1zH7IMxE",
    "projectPage": "https://hcie.csail.mit.edu/research/infraredtags/infraredtags.html",
    "description": "InfraredTags are 2D codes and markers imperceptible to the naked eye that can be 3D printed as part of objects, and detected rapidly by low-cost near-infrared cameras. InfraredTags achieve this by being printed from an infrared-transmitting filament which infrared cameras can see through, and by having air gaps inside for the tag’s bits which infrared cameras capture as darker pixels in the image."
  },
  {
    "id": 3,
    "title": "Lenticular Objects: 3D Printed Objects with Lenticular Lens Surfaces that Can Change their Appearance Depending on the Viewpoint.",
    "authors": "Jiani Zeng*, Honghao Deng*, <b>Yunyi Zhu*</b>, Michael Wessely, Axel Kilian, Stefanie Mueller.",
    "conference": "Proceedings of ACM UIST 2021. [* equal contribution]",
    "thumbnail": "lenticularobjects.gif",
    "doi": "https://dl.acm.org/doi/10.1145/3472749.3474815",
    "pdf": "https://hcie.csail.mit.edu/research/lenticularobject/lenticular-object.pdf",
    "video": "https://www.youtube.com/watch?v=tLCBk1Z3ZgQ",
    "projectPage": "https://hcie.csail.mit.edu/research/lenticularobject/lenticular-object.html",
    "description": "Lenticular Objects are 3D objects that appear differently under different viewpoints. We accomplish this by 3D printing lenticular lenses across the curved surface of objects. By calculating the lens distribution and the corresponding surface color patterns, we can determine which appearance is shown to the user at each viewpoint."
  },
  {
    "id": 1,
    "title": "MorphSensor: An Electronic Design Tool for Reforming Sensor Modules.",
    "authors": "Junyi Zhu, <b>Yunyi Zhu</b>, Jiaming Cui, Leon Cheng, Jackson C Snowden, Mark Chounlakone, Michael Wessely, Stefanie Mueller.",
    "conference": "Proceedings of ACM UIST 2020.",
    "thumbnail": "morphsensor-thumbnail.png",
    "description": "MorphSensor is a system that allows users to break down sensor modules into components and rearrange the pieces according to product's geometry, which better integrate with the three-dimensional shape of a physical prototype.",
    "doi": "https://dl.acm.org/doi/10.1145/3379337.3415898",
    "pdf": "http://groups.csail.mit.edu/hcie/files/research-projects/morphsensor/2020-UIST-morphsensor-paper.pdf",
    "video": "https://www.youtube.com/watch?v=d5o3LI0rL7A&feature=youtu.be",
    "projectPage": "https://hcie.csail.mit.edu/research/morphsensor/morphsensor.html"
  },
  {
    "id": 2,
    "title": "CurveBoards: Integrating Breadboards into Physical Objects to Prototype Function in the Context of Form.",
    "authors": "Junyi Zhu, Lotta-Gili Blumberg, <b>Yunyi Zhu</b>, Martin Nisser, Ethan Levi Carlson, Xin Wen, Kevin Shum, Jessica Ayeley Quaye, Stefanie Mueller.",
    "conference": "Proceedings of ACM CHI 2020.",
    "thumbnail": "curveboard-thumbnail.jpg",
    "description": "CurveBoards are breadboards integrated into physical objects. In contrast to traditional breadboards, CurveBoards better preserve the object’s look and feel while maintaining high circuit fluidity, which enables designers to exchange and reposition components during design iteration.",
    "doi": "https://dl.acm.org/doi/abs/10.1145/3313831.3376617",
    "pdf": "http://groups.csail.mit.edu/hcie/files/research-projects/curveboard/2020-CHI-curveboard-paper.pdf",
    "video": "https://www.youtube.com/watch?v=erV9JR0rjGs&feature=youtu.be",
    "projectPage": "https://hcie.csail.mit.edu/research/curveboard/curveboard.html"
  }
]